In [1]:
import pandas as pd 
import numpy as np

In [2]:
data = {'Name': ['Teodosija', 'Sutton', 'Taneli', 'Ravshan', 'Ross'],
        'Age': [26, 32, 25, 31, 28],
        'Salary': [50000, 60000, 45000, 70000, 55000]}
df = pd.DataFrame(data)

In [4]:
df['new_Sal'] = np.multiply(df['Salary'],1.5)

In [5]:
df

        Name  Age  Salary   new_Sal
0  Teodosija   26   50000   75000.0
1     Sutton   32   60000   90000.0
2     Taneli   25   45000   67500.0
3    Ravshan   31   70000  105000.0
4       Ross   28   55000   82500.0